layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "cont"
  top: "img_feature"
  top: "label"
  python_param {
    module: "vqa_data_provider_layer"
    layer: "VQADataProviderLayer"
    param_str: "{\"batchsize\": 24, \"mode\": \"val\"}"
  }
}
layer {
  name: "embed_ba"
  type: "Embed"
  bottom: "data"
  top: "embed_ba"
  embed_param {
    num_output: 300
    input_dim: 15534
    weight_filler {
      type: "uniform"
      min: -0.08
      max: 0.08
    }
  }
}
layer {
  name: "embed"
  type: "TanH"
  bottom: "embed_ba"
  top: "embed"
}
layer {
  name: "lstm1"
  type: "LSTM"
  bottom: "embed"
  bottom: "cont"
  top: "lstm1"
  recurrent_param {
    num_output: 1024
    weight_filler {
      type: "uniform"
      min: -0.08
      max: 0.08
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice_first0"
  type: "Slice"
  bottom: "lstm1"
  top: "slice_first0"
  top: "slice_first1"
  top: "slice_first2"
  top: "slice_first3"
  top: "slice_first4"
  top: "slice_first5"
  top: "slice_first6"
  top: "slice_first7"
  top: "slice_first8"
  top: "slice_first9"
  top: "slice_first10"
  top: "slice_first11"
  top: "slice_first12"
  top: "slice_first13"
  top: "lstm1_out"
  slice_param {
    axis: 0
  }
}
layer {
  name: "silence_data_first0"
  type: "Silence"
  bottom: "slice_first0"
}
layer {
  name: "silence_data_first1"
  type: "Silence"
  bottom: "slice_first1"
}
layer {
  name: "silence_data_first2"
  type: "Silence"
  bottom: "slice_first2"
}
layer {
  name: "silence_data_first3"
  type: "Silence"
  bottom: "slice_first3"
}
layer {
  name: "silence_data_first4"
  type: "Silence"
  bottom: "slice_first4"
}
layer {
  name: "silence_data_first5"
  type: "Silence"
  bottom: "slice_first5"
}
layer {
  name: "silence_data_first6"
  type: "Silence"
  bottom: "slice_first6"
}
layer {
  name: "silence_data_first7"
  type: "Silence"
  bottom: "slice_first7"
}
layer {
  name: "silence_data_first8"
  type: "Silence"
  bottom: "slice_first8"
}
layer {
  name: "silence_data_first9"
  type: "Silence"
  bottom: "slice_first9"
}
layer {
  name: "silence_data_first10"
  type: "Silence"
  bottom: "slice_first10"
}
layer {
  name: "silence_data_first11"
  type: "Silence"
  bottom: "slice_first11"
}
layer {
  name: "silence_data_first12"
  type: "Silence"
  bottom: "slice_first12"
}
layer {
  name: "silence_data_first13"
  type: "Silence"
  bottom: "slice_first13"
}
layer {
  name: "lstm1_reshaped"
  type: "Reshape"
  bottom: "lstm1_out"
  top: "lstm1_reshaped"
  reshape_param {
    shape {
      dim: -1
      dim: 1024
    }
  }
}
layer {
  name: "lstm1_reshaped_droped"
  type: "Dropout"
  bottom: "lstm1_reshaped"
  top: "lstm1_reshaped_droped"
  dropout_param {
    dropout_ratio: 0.3
  }
}
layer {
  name: "lstm1_droped"
  type: "Dropout"
  bottom: "lstm1"
  top: "lstm1_droped"
  dropout_param {
    dropout_ratio: 0.3
  }
}
layer {
  name: "lstm2"
  type: "LSTM"
  bottom: "lstm1_droped"
  bottom: "cont"
  top: "lstm2"
  recurrent_param {
    num_output: 1024
    weight_filler {
      type: "uniform"
      min: -0.08
      max: 0.08
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice_second0"
  type: "Slice"
  bottom: "lstm2"
  top: "slice_second0"
  top: "slice_second1"
  top: "slice_second2"
  top: "slice_second3"
  top: "slice_second4"
  top: "slice_second5"
  top: "slice_second6"
  top: "slice_second7"
  top: "slice_second8"
  top: "slice_second9"
  top: "slice_second10"
  top: "slice_second11"
  top: "slice_second12"
  top: "slice_second13"
  top: "lstm2_out"
  slice_param {
    axis: 0
  }
}
layer {
  name: "silence_data_second0"
  type: "Silence"
  bottom: "slice_second0"
}
layer {
  name: "silence_data_second1"
  type: "Silence"
  bottom: "slice_second1"
}
layer {
  name: "silence_data_second2"
  type: "Silence"
  bottom: "slice_second2"
}
layer {
  name: "silence_data_second3"
  type: "Silence"
  bottom: "slice_second3"
}
layer {
  name: "silence_data_second4"
  type: "Silence"
  bottom: "slice_second4"
}
layer {
  name: "silence_data_second5"
  type: "Silence"
  bottom: "slice_second5"
}
layer {
  name: "silence_data_second6"
  type: "Silence"
  bottom: "slice_second6"
}
layer {
  name: "silence_data_second7"
  type: "Silence"
  bottom: "slice_second7"
}
layer {
  name: "silence_data_second8"
  type: "Silence"
  bottom: "slice_second8"
}
layer {
  name: "silence_data_second9"
  type: "Silence"
  bottom: "slice_second9"
}
layer {
  name: "silence_data_second10"
  type: "Silence"
  bottom: "slice_second10"
}
layer {
  name: "silence_data_second11"
  type: "Silence"
  bottom: "slice_second11"
}
layer {
  name: "silence_data_second12"
  type: "Silence"
  bottom: "slice_second12"
}
layer {
  name: "silence_data_second13"
  type: "Silence"
  bottom: "slice_second13"
}
layer {
  name: "lstm2_reshaped"
  type: "Reshape"
  bottom: "lstm2_out"
  top: "lstm2_reshaped"
  reshape_param {
    shape {
      dim: -1
      dim: 1024
    }
  }
}
layer {
  name: "lstm2_reshaped_droped"
  type: "Dropout"
  bottom: "lstm2_reshaped"
  top: "lstm2_reshaped_droped"
  dropout_param {
    dropout_ratio: 0.3
  }
}
layer {
  name: "lstm_12"
  type: "Concat"
  bottom: "lstm1_reshaped_droped"
  bottom: "lstm2_reshaped_droped"
  top: "lstm_12"
}
layer {
  name: "q_emb_tanh_droped_resh"
  type: "Reshape"
  bottom: "lstm_12"
  top: "q_emb_tanh_droped_resh"
  reshape_param {
    shape {
      dim: -1
      dim: 2048
      dim: 1
      dim: 1
    }
  }
}
layer {
  name: "q_emb_tanh_droped_resh_tiled_1"
  type: "Tile"
  bottom: "q_emb_tanh_droped_resh"
  top: "q_emb_tanh_droped_resh_tiled_1"
  tile_param {
    axis: 2
    tiles: 14
  }
}
layer {
  name: "q_emb_tanh_droped_resh_tiled"
  type: "Tile"
  bottom: "q_emb_tanh_droped_resh_tiled_1"
  top: "q_emb_tanh_droped_resh_tiled"
  tile_param {
    axis: 3
    tiles: 14
  }
}
layer {
  name: "i_emb_tanh_droped_resh"
  type: "Reshape"
  bottom: "img_feature"
  top: "i_emb_tanh_droped_resh"
  reshape_param {
    shape {
      dim: -1
      dim: 2048
      dim: 14
      dim: 14
    }
  }
}
layer {
  name: "blcf"
  type: "CompactBilinear"
  bottom: "q_emb_tanh_droped_resh_tiled"
  bottom: "i_emb_tanh_droped_resh"
  top: "blcf"
  compact_bilinear_param {
    num_output: 16000
    sum_pool: false
  }
}
layer {
  name: "blcf_sign_sqrt"
  type: "SignedSqrt"
  bottom: "blcf"
  top: "blcf_sign_sqrt"
}
layer {
  name: "blcf_sign_sqrt_l2"
  type: "L2Normalize"
  bottom: "blcf_sign_sqrt"
  top: "blcf_sign_sqrt_l2"
}
layer {
  name: "blcf_droped"
  type: "Dropout"
  bottom: "blcf_sign_sqrt_l2"
  top: "blcf_droped"
  dropout_param {
    dropout_ratio: 0.1
  }
}
layer {
  name: "att_conv1"
  type: "Convolution"
  bottom: "blcf_droped"
  top: "att_conv1"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "att_conv1_relu"
  type: "ReLU"
  bottom: "att_conv1"
  top: "att_conv1_relu"
}
layer {
  name: "att_conv2"
  type: "Convolution"
  bottom: "att_conv1_relu"
  top: "att_conv2"
  convolution_param {
    num_output: 2
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "att_reshaped"
  type: "Reshape"
  bottom: "att_conv2"
  top: "att_reshaped"
  reshape_param {
    shape {
      dim: -1
      dim: 2
      dim: 196
    }
  }
}
layer {
  name: "att_softmax"
  type: "Softmax"
  bottom: "att_reshaped"
  top: "att_softmax"
  softmax_param {
    axis: 2
  }
}
layer {
  name: "att"
  type: "Reshape"
  bottom: "att_softmax"
  top: "att"
  reshape_param {
    shape {
      dim: -1
      dim: 2
      dim: 14
      dim: 14
    }
  }
}
layer {
  name: "att_map0"
  type: "Slice"
  bottom: "att"
  top: "att_map0"
  top: "att_map1"
  slice_param {
    axis: 1
  }
}
layer {
  name: "DummyData1"
  type: "DummyData"
  top: "DummyData1"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 1
    }
    shape {
      dim: 24
      dim: 1
    }
  }
}
layer {
  name: "att_feature0"
  type: "SoftAttention"
  bottom: "i_emb_tanh_droped_resh"
  bottom: "att_map0"
  bottom: "DummyData1"
  top: "att_feature0"
}
layer {
  name: "att_feature1"
  type: "SoftAttention"
  bottom: "i_emb_tanh_droped_resh"
  bottom: "att_map1"
  bottom: "DummyData1"
  top: "att_feature1"
}
layer {
  name: "att_feature0_resh"
  type: "Reshape"
  bottom: "att_feature0"
  top: "att_feature0_resh"
  reshape_param {
    shape {
      dim: -1
      dim: 2048
    }
  }
}
layer {
  name: "att_feature1_resh"
  type: "Reshape"
  bottom: "att_feature1"
  top: "att_feature1_resh"
  reshape_param {
    shape {
      dim: -1
      dim: 2048
    }
  }
}
layer {
  name: "att_feature"
  type: "Concat"
  bottom: "att_feature0_resh"
  bottom: "att_feature1_resh"
  top: "att_feature"
}
layer {
  name: "att_feature_resh"
  type: "Reshape"
  bottom: "att_feature"
  top: "att_feature_resh"
  reshape_param {
    shape {
      dim: -1
      dim: 4096
      dim: 1
      dim: 1
    }
  }
}
layer {
  name: "lstm_12_resh"
  type: "Reshape"
  bottom: "lstm_12"
  top: "lstm_12_resh"
  reshape_param {
    shape {
      dim: -1
      dim: 2048
      dim: 1
      dim: 1
    }
  }
}
layer {
  name: "bc_att_lstm"
  type: "CompactBilinear"
  bottom: "att_feature_resh"
  bottom: "lstm_12_resh"
  top: "bc_att_lstm"
  compact_bilinear_param {
    num_output: 16000
    sum_pool: false
  }
}
layer {
  name: "bc_sign_sqrt"
  type: "SignedSqrt"
  bottom: "bc_att_lstm"
  top: "bc_sign_sqrt"
}
layer {
  name: "bc_sign_sqrt_l2"
  type: "L2Normalize"
  bottom: "bc_sign_sqrt"
  top: "bc_sign_sqrt_l2"
}
layer {
  name: "bc_dropped"
  type: "Dropout"
  bottom: "bc_sign_sqrt_l2"
  top: "bc_dropped"
  dropout_param {
    dropout_ratio: 0.1
  }
}
layer {
  name: "bc_dropped_resh"
  type: "Reshape"
  bottom: "bc_dropped"
  top: "bc_dropped_resh"
  reshape_param {
    shape {
      dim: -1
      dim: 16000
    }
  }
}
layer {
  name: "prediction"
  type: "InnerProduct"
  bottom: "bc_dropped_resh"
  top: "prediction"
  inner_product_param {
    num_output: 3000
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "prediction"
  bottom: "label"
  top: "loss"
}
